# Datos faltantes
* Ahora veremos como trabajar con datos faltantes
* Estas son t√©cnicas basicas, la imputacion es un tema que puede ser mucho mas complejo y requiere estudiarse mas adelante.

In [1]:
import numpy as np
import pandas as pd

Creamos un dataframe que tenga valores faltantes<BR>
Podemos colocar un NaN al usar np.nan

In [2]:
d={'A':[2,4,np.nan], 'B':[3,np.nan,np.nan], 'C':[5,10,15]}
df1=pd.DataFrame(d)
print(df1)

     A    B   C
0  2.0  3.0   5
1  4.0  NaN  10
2  NaN  NaN  15

## Eliminar filas y columnas con valores faltantes
Con dropna pandas elimina filas con valores faltantes<BR>
    Con que se tenga un valor faltante es bastante para eliminar la fila

In [3]:
r1=df1.dropna()
print(r1)

     A    B  C
0  2.0  3.0  5

Tambien podemos hacerlo con columnas al indicar el eje

In [4]:
r2=df1.dropna(axis=1)
print(r2)

    C
0   5
1  10
2  15

Podemos colocar un umbral para indicar si una fila/columna con al menos n valores correctos se conserva

In [5]:
r3=df1.dropna(thresh=2)
print(r3)
print('------')
r3c=df1.dropna(thresh=2,axis=1)
print(r3c)

     A    B   C
0  2.0  3.0   5
1  4.0  NaN  10
------
     A   C
0  2.0   5
1  4.0  10
2  NaN  15

## Rellenar valores faltantes
Si lo deseamos podemos llenar los nan

In [6]:
r4=df1.fillna(value=10)
print(r4)

      A     B   C
0   2.0   3.0   5
1   4.0  10.0  10
2  10.0  10.0  15

Podemos colocar los valores faltantes de una columna al valor de la media de esa columna

In [7]:
r5=df1['A'].fillna(value=df1['A'].mean())
print(r5)

0    2.0
1    4.0
2    3.0
Name: A, dtype: float64

In [8]:
df1

     A    B   C
0  2.0  3.0   5
1  4.0  NaN  10
2  NaN  NaN  15

In [9]:
df1['A'].fillna(value=df1['A'].mean(), inplace=True)

In [10]:
df1

     A    B   C
0  2.0  3.0   5
1  4.0  NaN  10
2  3.0  NaN  15